name: "vae"
platform: "onnxruntime_onnx"
max_batch_size: 4

input [
  {
    name: "latent_sample"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1]
  }
]
output [
  {
    name: "sample"
    data_type: TYPE_FP32
    dims: [ 3, -1, -1]
  }
]

instance_group [
  {
    kind: KIND_GPU
  }
]